drop database if exists shop_sc;
create database shop_sc character set utf8;
use shop_sc;
drop table if exists shop_sc.admin;
create table shop_sc.admin
(
	username char(16) not null primary key,
	password char(40) not null
);
drop table if exists shop_sc.product;
create table shop_sc.product
(
   productid int(10) unsigned not null auto_increment primary key,
   farsiname char(60) not null,
   englishname char(60) not null,
   description text not null,
   catid int(10) unsigned not null,
   price decimal(10,0) not null,
   dat datetime not null,
   imageurl char(60)not null
);
drop table if exists shop_sc.categories;
create table shop_sc.categories
(
  catid int(10) unsigned not null auto_increment primary key,
  catname char(60) not null
);
drop table if exists shop_sc.order;
create table shop_sc.order
(
   orderid int(10) unsigned not null auto_increment primary key,
   productid int(10) unsigned not null,
   items int(10) not null,
   total_price decimal(10,0) not null,
   name char(50) not null,
   tel char(50) not null,
   address text not null,
   zipcode char(50) not null
);
grant select, insert, update, delete
on shop_sc.*
to shop_sc@localhost identified by 'password';

INSERT INTO admin VALUES ('admin', sha1('admin'));

INSERT INTO shop_sc.categories VALUES (NULL,'کامپیوتر');
INSERT INTO shop_sc.categories VALUES (NULL,'دوربین');
INSERT INTO shop_sc.categories VALUES (NULL,'تلفن همراه');
INSERT INTO shop_sc.categories VALUES (NULL,'چاپگر و اسکنر');
INSERT INTO shop_sc.categories VALUES (NULL,'صوتی تصویری');

INSERT INTO `product` (`productid`, `farsiname`, `englishname`, `description`, `catid`, `price`, `dat`, `imageurl`) VALUES
(1, 'فراسو اف‌باکس-۶۱۶ ای', 'Farassoo FBOX-616 A', 'پردازنده اینتل دو هسته ای -حافظه ۲گیگابایتی - ۵۰۰ گیگابایت دیسک سخت از نوع ساتا دو - درایو نوری 24x ساتا - مودم - صفحه کلید و ماوس فراسو. ', 1, '499000', '2010-03-11 15:32:19', 'image/11446.jpg'),
(3, 'فراسو اف‌باکس-۶۱۴ ای', 'Farassoo FBOX-614 A', 'پردازنده اینتل دو هسته ای -حافظه ۲گیگابایتی - ۵۰۰ گیگابایت دیسک سخت از نوع ساتا دو - درایو نوری 24x ساتا - مودم - صفحه کلید و ماوس فراسو. ', 1, '499000', '2010-03-11 15:36:45', 'image/11446.jpg'),
(4, 'لوکت جی۸', 'Looket G8', 'دستگاه راهیاب با طراحی زیبا و باریک، صفحه نمایش ۳٫۵ اینچ لمسی، سیستم ناوبری مجهز به پردازشگر ۴۰۰ مگاهرتز، مبتنی بر سیستم عامل Windows CE.Net 5.0 و گیرنده قوی سیگنال جی‌پی‌اس، ...', 1, '195000', '2010-03-11 15:37:45', 'image/11426.jpg'),
(11, 'نیکون دی‌۳۰۰اس', 'Nikon D300s', 'دوربین عکاسی دیجیتال حرفه‌ای، ۱۲٫۳ مگاپیکسل، تک لنز انعکاسی (SLR)، سرعت عکسبرداری بالا، صفحه نمایش ۳ اینچ، فیلمبرداری حرفه‌ای، خروجی HDMI، قالب عکس RAW برای تنظیمات حرفه‌ای تصاویر گرفته شده، امکان عکسبرداری با فاصله زمانی، بدنه سبک و فشرده، پشتیبانی کارت حافظه SD و SDHC و MMC ', 2, '1700000', '2010-03-11 15:46:20', 'image/11338.jpg'),
(7, 'فراسو اف‌سی‌آر-۶۶۰۰ بیسیم', 'Farassoo FCR-6600 RF', '- کیبورد بیسیم ۱۰۲ کلیده ، - عملکرد با فرکانس ۲٫۴ گیگا هرتز و برد عملکرد حداکثر ۱۰ متر . - به همراه صفحه ماوس با عملکرد لمسی . - دو سال گارانتی فراسو . ', 1, '41000', '2010-03-11 15:43:00', 'image/11418.jpg'),
(13, 'کانن ای‌اواس ۷دی', 'Canon EOS 7D', 'دوربین عکاسی دیجیتال حرفه‌ای، ۱۸ مگا پیکسل، تک لنز انعکاسی (SLR)، سنسور CMOS، فیلمبرداری Full HD، پردازشگر تصویر DiG!C 4، قالب عکس RAW برای تنظیمات حرفه‌ای تصاویر گرفته شده، حساسیت بالا برای گرفتن تصاویر شفاف در نور کم، صفحه نمایش ۳ اینچ، خروجی HDMI، پشتیبانی کارت حافظه CF ', 2, '200000', '2010-03-11 15:48:12', 'image/11247.jpg'),
(12, 'نیکون کول‌پیکس ال۱۰۰', 'Nikon Coolpix L100', 'دوربین عکاسی دیجیتال کوچک با کیفیت عکس ۱۰ مگاپیکسل، قابلیت بزرگنمایی اپتیکال تا ۱۵ برابر، عکسبرداری پیاپی مخصوص صحنه‌های ورزشی، تکنولوژی لرزشگیر تصویر، ثبت تصاویر باکیفیت از سوژه‌های متحرک، حساسیت بالا تا ۳۲۰۰، نمایشگر ۳ اینچی، فیلمبرداری با کیفیت VGA، فرمان ثبت تصاویر با لبخند و هشدار هنگام پلک زدن، پشتیبانی کارت SD و SDHC', 2, '24000', '2010-03-11 15:47:17', 'image/11335.jpg'),
(14, 'کانن دیجیتال ایکسوس ۲۰۰ آی‌اس', 'Canon Digital IXUS 200 IS', 'دوربین دیجیتال خیلی کوچک با کیفیت عکس ۱٢ مگاپیکسل، حسگر CCD، دارای لرزشگیر تصویر، قابلیت زوم اپتیکال تا ۵ برابر، لنز واید ٢۴ میلیمتری، پردازشگر DiG!C4، فیلمبرداری با کیفیت HD، اولین دوربین فشرده کانن با صفحه نمایش لمسی ۳ اینچی عریض، حساسیت بالا برای عکسبرداری در نور کم، چاپ مستقیم توسط چاپگر بدون نیاز به کامپیوتر، پشتیبانی کارت SD، SDHC و MMC، تصحیح قرمزی چشم، تشخیص چهره و حرکت', 2, '330000', '2010-03-11 15:49:20', 'image/11214.jpg'),
(16, 'اچ‌تی‌سی گوگل نکسز وان', 'HTC Google Nexus One', 'گوشی با سیستم عامل Android نسخه ۲٫۱، پردازنده یک گیگاهرتز، صفحه نمایش ۳٫۷ اینچ لمسی با وضوح بسیار بالا، مسیریاب جی‌پی‌اس، قطب‌نمای دیجیتالی، حسگر شتاب‌سنج برای دوران خودکار صفحه، دوربین ۵ مگاپیکسل، تشخیص لبخند، فوکوس اتوماتیک، ثبت موقعیت جغرافیای به همراه تصویر، فیلمبرداری با وضوح مشابه دی‌وی‌دی، شبکه بیسیم، حسگر مجاورت‌سنج، حافظه داخلی ۵۱۲ مگابایتی، بلوتوث استریو، خروجی صدای استاندارد، ..', 3, '840000', '2010-03-11 15:51:28', 'image/11362.jpg'),
(17, 'سامسونگ سی۶۱۱۲', 'Samsung C6112', 'گوشی کشویی با امکان وجود دو سیم‌کارت به طور همزمان، دوربین ۲ مگاپیکسل، صفحه نمایش ۲۶۲۱۴۴ رنگ ۲٫۴ اینچ، فناوری صوتی DNSe(صدای طبیعی دیجیتال)، ۳۰ مگابایت حافظه داخلی، بلوتوث استریو، رادیوی اف‌ام استریو با قابلیت ضبط، ...', 3, '200000', '2010-03-11 15:53:22', 'image/11433.jpg'),
(19, 'نوکیا ایکس۶', 'Nokia X6', 'گوشی با صفحه نمایش ۳٫۲ اینچ لمسی و وضوح بالا، تفکیک ۱۶ میلیون رنگ، ۳۲ گیگابایت حافظه داخلی، مسیر‌یاب جی‌پی‌اس، دوربین ۵ مگاپیکسل، فوکوس اتوماتیک، ثبت موقعیت جغرافیایی به همراه تصویر، حسگر شتاب‌سنج جهت دوران خودکار صفحه، حسگر مجاورت‌سنج، سیستم عامل Symbian نسخه ۹٫۴، شبکه بیسیم به همراه فناوری UPnP، خروجی تلویزیون، خروجی صدای استاندارد، رادیوی اف‌ام استریو، بلوتوث استریو، نمایش پرونده‌های آفیس و پی‌دی‌اف، بلندگوهای استریو، ...', 3, '605000', '2010-03-11 15:55:49', 'image/11331.jpg'),
(20, 'نوکیا ۸۸۰۰ گلد آرته', 'Nokia 8800 Gold Arte', 'طراحی لوکس، پوشش طلای ۱۸ عیار و چرم سفید، صفحه نمایش OLED و ۱۶ میلیون رنگ، دوربین ۳٫۱۵ مگاپیکسل، فوکوس اتوماتیک، ۴ گیگابایت حافظه داخلی، پخش فیلم و موسیقی، تجهیزات بیشتر در داخل بسته‌بندی از جمله هدست بلوتوث، ... ', 3, '1470000', '2010-03-11 16:00:55', 'image/10992.jpg'),
(21, 'نوکیا ۸۸۰۰ کربن آرته', 'Nokia 8800 Carbon Arte', 'طراحی لوکس، شیشه ضدخش، صفحه نمایش OLED با ۱۶ میلیون رنگ، دوربین ۳٫۱۵ مگاپیکسل، فوکوس اتوماتیک، ۴ گیگابایت حافظه داخلی، پخش فیلم و موسیقی، تجهیزات بیشتر در داخل بسته‌بندی از جمله هدست بلوتوث، ... ', 3, '1119000', '2010-03-11 16:03:08', 'image/10950.jpg'),
(22, 'اچ‌پی کالر لیزرجت ۵۵۵۰دی‌تی‌ان', 'HP Color LaserJet 5550dtn', 'سرعت چاپ مشکی (با کیفیت معمولی) تا 28 برگ در دقیقه .سرعت چاپ رنگی (باکیفیت معمولی )تا28 برگ در دقیقه ظرفیت ماهانه ، حداکثر تا 12000 برگ سرعت، قابلیت چاپ پشت و رو زن بصورت اتوماتیک.کارت شبکه استاندارد ', 4, '51370600', '2010-03-11 16:04:15', 'image/11091.jpg'),
(23, 'اچ‌پی لیزرجت ۹۰۴۰ ان', 'HP LaserJet 9040n', 'سرعت چاپ مشکی (با کیفیت معمولی) تا 40 برگ در دقیقه ظرفیت ماهانه، کیفیت چاپ600*600 نقطه در اینچ ، قابل دسترس 15000 تا 30000 برگ ظرفیت ماهانه، حداکثر تا 300000 برگ سرعت، قابلیت چاپ پشت و رو زن بصورت دستی کارت شبکه استاندارد ', 4, '36710200', '2010-03-11 16:05:34', 'image/11078.jpg'),
(24, 'اچ‌پی لیزرجت پی۴۵۱۵ ایکس', 'HP LaserJet P4515x', 'سرعت چاپ مشکی (با کیفیت معمولی )سرعت60برگ در دقیقه ظرفیت ماهانه، کیفیت چاپ1200*1200 نقطه در اینج ظرفیت ماهانه، حداکثر تا 275000 برگ سرعت، قابلیت چاپ پشت و رو زن بصورت اتوماتیک امکانات شبکه:استاندارد ', 4, '2504000', '2010-03-11 16:06:41', 'image/11075.jpg'),
(25, 'اچ‌پی کالر لیزرجت ۴۷۰۰دی‌ان', 'HP Color LaserJet 4700dn', 'سرعت چاپ مشکی (با کیفیت معمولی) تا 30 برگ در دقیقه سرعت چاپ رنگی(باکیفیت معمولی) تا30برگ در دقیقه ، کیفیت چاپ600*600 نقطه در اینچ ،ظرفیت ماهانه حداکثر تا 100000 برگ سرعت، قابلیت چاپ پشت و رو زن بصورت اتوماتیک کارت شبکه استاندارد', 4, '2308000', '2010-03-11 16:07:42', 'image/11086.jpg'),
(26, 'سینمای خانگی پاناسونیک اس‌سی-اچ‌تی ۸۸۰', 'Panasonic Home Theater System SC-HT880', 'سینمای خانگی با قابلیت اسکن پیشرونده، توان خروجی صدا ۷۰۰ وات ', 5, '380000', '2010-03-11 16:08:37', 'image/10383.jpg'),
(27, 'پاناسونیک تی‌ایکس ۵۱ پی ۸۰۰ ایکس', 'Panasonic TX-51P800X', 'تلوزیون ۵۱ اینچ پروجکشن سری تائو گیگا ۱۰۰ هرتز، تصویر در تصویر، تله تکست فارسی', 5, '1900000', '2010-03-11 16:09:45', 'image/10416.jpg'),
(28, 'پاناسونیک تی‌ایکس ۲۹ پی ۸۰۰', 'Panasonic TX-29P800', 'تلوزیون ۲۹ اینچ صفحه تخت سری تائو گیگا ۱۰۰ هرتز، پشتیبانی HD، تصویر در تصویر، تله تکست فارسی', 5, '835000', '2010-03-11 16:10:42', 'image/10417.jpg');




